Revit 2027 API
AnalyticalToPhysicalAssociationManager.RemoveAssociation Method
 This method will remove the association for the element with the given ElementId.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveAssociation(
	ElementId id
)
Public Sub RemoveAssociation (
	id As ElementId
)
public:
void RemoveAssociation(
	ElementId^ id
)
member RemoveAssociation :
        id : ElementId -> unit
Parameters
id ElementId
 Id of the element for which we want to remove the association.
Exceptions
Exception | Condition
ArgumentException |  This element doesn't have an association defined.
ArgumentNullException |  A non-optional argument was null
Remarks
 If the id does not have any association, an exception is thrown.
See Also
Reference
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace